Repository: The-Ofek-Foundation/ophd
Catalog: lib/l10n/app_*.arb
Languages: he

source: Ofek Gila
he: אופק גילה

# title
source: Ofek's Portfolio
he: הפורטפוליו של אופק

# mySubtitle
source: PhD Student, Computer Science @ UCI
he: סטודנט דוקטורט, מדעי המחשב @ UCI

# label
source: {key, select, GoogleScholar {Google Scholar} other {{key}}}
he: {key, select, Family {משפחה} Website {אתר אישי} Blog {בלוג} LinkedIn {לינקדאין} Email {אימייל} Paper {מאמר} WhatsApp {וואטסאפ} Resume {קורות החיים} Sync {אחזר שיתופי פעולה חדשים} GoogleScholar {גוגל סקולר} other {{key}}}

# name
source: {key, select, ofek {Ofek Gila} mikeg {Michael Goodrich} bob {Robert Tarjan} evrim {Evrim Ozel} mikes {Michael Shindler} miked {Michael Dillencourt} nero {Nero Li} shahar {Shahar Broner} yubin {Yubin Kim} katrina {Katrina Mizuo} elijah {Elijah Sauder} claire {Claire To} albert {Albert Wang} abraham {Abraham Illickan} vinesh {Vinesh Sridhar} paul {Paul Erdős} hedet {Stephan Hedetniemi} other {{key}}}
he: {key, select, ofek {אופק גילה} mikeg {מייקל גודריץ'} bob {רוברט טרג'אן} evrim {אברים אוזל} mikes {מייקל שינדלר} miked {מייקל דילנקורט} nero {נירו לי} shahar {שחר ברונר} yubin {יובין קים} katrina {קתרינה מיזאו} elijah {אליהו סאדר} claire {קלייר טו} albert {אלברט וואנג} abraham {אברהם איליקן} vinesh {וינש סרידהאר} paul {פול ארדש} hedet {סטפן הדטנימי} david {דייוויד אפשטיין} ryuto {ריוטו קיטגאווה} dan {דניאל הירשברג} shayan {שיאן טהריג'אם} zahra {זהרא האדיזאדה} other {{key}}}

# page
source: {key, select, other {{key}}}
he: {key, select, About {אודות} Research {מחקר} Publications {פרסומים} Education {השכלה} Contact {צור קשר} Industry {תעשייה} Lab {מעבדה} other {{key}}}

# researchPrimary
source: Primary Research
he: מחקר עיקרי

# researchPrimarySubtitle
source: Algorithms in the Real World
he: אלגוריתמים בעולם האמיתי

source: Research Collaborators
he: שותפי מחקר

# researchCollaboratorsSubtitle
source: Special thanks to my amazing advisor, {name}
he: תודה במיוחד למנחה המדהים שלי, {name}

# researchDescription
source: My work combines computer science theory with experimental validation, focusing on randomized data structures including graph models and binary search trees.
he: עבודתי משלבת תיאוריה במדעי המחשב עם אימות ניסיוני, תוך התמקדות במבני נתונים אקראיים, כולל מודלים של גרפים ועצי חיפוש בינאריים.

# erdosNumber
source: Erdős Number
he: מספר ארדש

# erdosNumberSubtitle
source: Learn more about Erdős numbers
he: למד עוד על מספרי ארדש

# labGraphTitle
source: Lab Collaboration Graph
he: גרף שיתופי פעולה במעבדה

# labGraphSubtitle
source: Interactive visualization of research collaborations
he: ויזואליזציה אינטראקטיבית של שיתופי פעולה במחקר

# labGraphDescriptionStart
source: Here is a graph of all the members of my lab, the
he: לפניכם גרף של כל חברי המעבדה שלי,

# labGraphDescriptionLink
source: theory lab
he: מעבדת התיאוריה

# labGraphDescriptionEnd
source: , at UCI. Edges correspond to co-authorship on research papers. Feel free to select faculty members to see their collaborations, and on any person to see more details.
he: , ב-UCI. הקשתות מייצגות כתיבה משותפת של מאמרי מחקר. אתם מוזמנים לבחור בחברי הסגל כדי לראות את שיתופי הפעולה שלהם, ועל כל אדם כדי לראות פרטים נוספים.

# unconnectedLabMembersTitle
source: Unconnected Lab Members
he: חברי מעבדה ללא קשרים

# unconnectedLabMembersSubtitle
source: The {count} lab members who have not (yet) collaborated with any other lab members or shown faculty are listed below.
he: ה-{count} חברי המעבדה שטרם שיתפו פעולה עם חברי מעבדה אחרים או עם חברי הסגל המוצגים באיור, רשומים מטה.

# link
source: {key, select, viewPaper {View paper} viewPage {View {name}'s page} other {{key}}}
he: {key, select, viewPaper {צפה במאמר} viewPage {צפה בעמוד של {name}} other {{key}}}

# labGraphInfo
source: If you are a lab member and have a missing connection, please try syncing the database from the reload button. If that doesn't work, it is possible that either your publication is too recent and does not (yet) appear in DBLP, I have an incorrect DBLP ID associated with you, or your publication is in an adjacent field and does not appear in DBLP. In either case, you can contact me to manually update the data.
he: אם אתה חבר מעבדה ואם חסר לך חיבור, אנא נסה לסנכרן את מסד הנתונים באמצעות כפתור הטעינה מחדש. אם זה לא עובד, ייתכן שהפרסום שלך חדש מדי ועדיין לא מופיע ב-DBLP, שיש לי מזהה DBLP שגוי המשויך אליך, או שהפרסום שלך בתחום משיק ואינו מופיע ב-DBLP. בכל אחד מהמקרים, תוכל ליצור איתי קשר כדי לעדכן את הנתונים באופן ידני.

# labInfoTitle
source: UCI Theory Lab
he: מעבדת התיאוריה של UCI

# labInfoSubtitle
source: Exploring theoretical computer science since 1975
he: חוקרים מדעי המחשב התיאורטיים מאז 1975

# labInfoDescription
source: This page showcases the Theory Lab at the University of California, Irvine. It includes a visualization of lab collaborations, highlights of research achievements, and statistics about publications, students, and faculty members over the years.
he: עמוד זה מציג את מעבדת התיאוריה באוניברסיטת קליפורניה, אירווין. הוא כולל ויזואליזציה של שיתופי פעולה במעבדה, הדגשה של הישגי מחקר, וסטטיסטיקות על פרסומים, סטודנטים וחברי סגל לאורך השנים.

source: Loading Lab Data
he: טוען נתוני מעבדה

source: Sync Database
he: סנכרון מסד נתונים

source: Fetch Real Data
he: אחזר נתונים אמיתיים

source: Try Again
he: נסה שוב

source: Error
he: שגיאה

# disclaimerTitle
source: Disclaimer
he: הסתייגות

# disclaimerSubtitle
source: Data may not be 100% accurate
he: הנתונים עלולים לא להיות מדויקים ב-100%

# disclaimerTextStart
source: Knowledge of lab members is taken from
he: המידע על חברי המעבדה נלקח מ

# disclaimerLinkDavidPage
source: David Eppstein's fabulous UCI computer science theory page
he: עמוד התיאוריה המדהים של דייוויד אפשטיין מ-UCI

# disclaimerTextMiddle
source: . The rest of the data is taken from
he: . שאר הנתונים נלקחים מ

# disclaimerTextEnd
source: , which is a database of computer science publications. DBLP was chosen because it assigns each researcher a unique ID automatically, it includes historical data, and it is fairly comprehensive. Alternatives, such as Google Scholar and ORCID, require the user to manually create their profile. DBLP is not perfect, however, being less comprehensive than Google Scholar, and not containing citation information which would have been nice to have. That being said, if there are any publications or changes you would like me to manually add, please contact me.
he: , שהוא מסד נתונים של פרסומים במדעי המחשב. DBLP נבחר מכיוון שהוא מקצה לכל חוקר מזהה ייחודי באופן אוטומטי, הוא כולל נתונים היסטוריים, והוא מקיף למדי. חלופות, כמו Google Scholar ו-ORCID, דורשות מהמשתמש ליצור את הפרופיל שלו באופן ידני. DBLP אינו מושלם, עם זאת, הוא פחות מקיף מ-Google Scholar, ואינו מכיל מידע על ציטוטים שהיה נחמד שיהיה. עם זאת, אם יש פרסומים או שינויים שתרצו שאוסיף באופן ידני, אנא צרו איתי קשר.

# labHighlightsTitle
source: Lab Highlights
he: דגשים של המעבדה

# labHighlightsSubtitle
source: Key statistics and insights about the lab
he: סטטיסטיקות מרכזיות ותובנות על המעבדה

source: Most Total Collaborations
he: הכי הרבה שיתופי פעולה

# studentsLabel
source: Students:
he: סטודנטים:

# publicationsTheory
source: Theoretical Computer Science
he: מדעי המחשב התיאורטיים

# publicationsTheorySubtitle
source: Randomized Algorithms and Data Structures
he: אלגוריתמים ומבני נתונים אקראיים

# publicationsEducation
source: Computer Science Education
he: חינוך במדעי המחשב

# publicationsEducationSubtitle
source: Research in CS Education at UCI
he: מחקר בחינוך במדעי המחשב ב-UCI

# publicationsEducationIntro
source: I've had the opportunity to tag along on some CS ed research projects.
he: הייתה לי הזדמנות להשתתף בכמה מחקרים בתחום החינוך במדעי המחשב.

# educationJourney
source: Educational Journey
he: מסע חינוכי

# educationJourneySubtitle
source: From High School to Graduate Studies
he: מהתיכון ועד ללימודים מתקדמים

# educationBackground
source: Academic Background
he: רקע אקדמי

# educationBackgroundSubtitle
source: Computer Science and Physics at UCI
he: מדעי המחשב ופיזיקה ב-UCI

# educationCurrentStudies
source: Current Studies
he: לימודים נוכחיים

# educationCurrentStudiesDetails
source: PhD in CS Theory (Algorithms in the Real World), UCI, ongoing
he: דוקטורט בתיאוריה של מדעי המחשב (אלגוריתמים בעולם האמיתי), UCI, מתמשך

# educationMasterNote
source: Masters attained on the way
he: תואר שני הושג בדרך

# educationUndergrad
source: Undergraduate Studies
he: לימודי תואר ראשון

# educationStoryStart
source: I was raised in Cupertino, CA, and graduated from
he: גדלתי בקופרטינו, קליפורניה, וסיימתי את

# educationStoryMid
source: . My passion for programming ignited during my freshman year with my first programming course. I continued to engage with AP Computer Science A as both a student and teaching assistant. In 2017, I started at
he: . התשוקה שלי לתכנות התעוררה במהלך שנת הלימודים הראשונה שלי עם קורס התכנות הראשון שלי. המשכתי להשתתף ב-AP Computer Science A הן כתלמיד והן כעוזר הוראה. בשנת 2017, התחלתי ב-

# educationStoryEnd
source: , pursuing a double major in Computer Science and Physics, graduating in 2021. Currently, I am pursuing a PhD at UCI.
he: , בתואר כפול במדעי המחשב ופיזיקה, וסיימתי בשנת 2021. כיום, אני לומד לדוקטורט ב-UCI.

# montaVistaHS
source: Monta Vista High School
he: תיכון מונטה ויסטה

# uci
source: the University of California, Irvine
he: אוניברסיטת קליפורניה, אירווין

# degree
source: BS in {subject}, 2021
he: תואר ראשון ב{subject}, 2021

source: Physics
he: פיזיקה

source: Computer Science
he: מדעי המחשב

source: UCI Homepage
he: דף הבית של UCI

source: UCI Theory Group
he: קבוצת התיאוריה של UCI

# summa
source: Summa Cum Laude
he: סומה קום לאודה

# magna
source: Magna Cum Laude
he: מגנה קום לאודה

source: Industry Experience
he: ניסיון תעשייתי

# industryExperienceSubtitle
source: From Startups to Large Corporations
he: מסטארט-אפים ועד תאגידים גדולים

# conference
source: {key, select, COCOA {Conference on Combinatorial Optimization and Applications} WADS {Algorithms and Data Structures Symposium} CCSC {Journal of Computing Sciences in Colleges} SIGCSE {Special Interest Group on Computer Science Education} CIAC {International Conference on Algorithms and Complexity} other {{key}}}
he: {key, select, COCOA {הכנס לאופטימיזציה קומבינטורית ויישומים} WADS {הסימפוזיון לאלגוריתמים ומבני נתונים} CCSC {כתב העת למדעי המחשב במכללות} SIGCSE {קבוצת העניין המיוחדת בחינוך מדעי המחשב} CIAC {הכנס הבינלאומי לאלגוריתמים ומורכבות} ACDA {הכנס של סיאם לאלגוריתמים בדידים יישומיים וחישוביים} CCCG {הכנס הקנדי לגאומטריה חישובית} other {{key}}}

# award
source: {key, select, Best_Paper {Best Paper} other {{key}}}
he: {key, select, Best_Paper {מאמר מצטיין} Best_Student_Presentation {הרצאת הסטודנט המצטיינת} other {{key}}}

# advisor
source: {count, plural, =1{Advisor} other{Advisors}}
he: {count, plural, =1{מנחה} other{מנחים}}

source: Graduation Year
he: שנת סיום

# advisorAndGraduation
source: Graduation Details
he: פרטי סיום

source: Thesis Title
he: כותרת התזה

source: Graduate Students
he: תלמידי מחקר

# current
source: Current: {count}
he: נוכחי: {count}

# studentCount
source: {count, plural, =1{student} other{students}}
he: {count, plural, =1{סטודנט} other{סטודנטים}}

source: Recent Graduates
he: בוגרים אחרונים

source: Publications by Type
he: פרסומים לפי סוג

source: Research Collaborations
he: שיתופי פעולה מחקריים

source: Faculty Co-authors
he: שותפי כתיבה מהסגל

source: Student Co-authors
he: שותפי כתיבה סטודנטים

source: Top Lab Collaborators
he: שותפי מעבדה מובילים

source: Recent Lab Collaborators
he: שותפי מעבדה אחרונים

source: Recent Publications
he: פרסומים אחרונים

source: Visit website
he: בקר באתר

source: View on DBLP
he: צפה ב-DBLP

source: Done
he: סיום

# publicationType
source: {type, select, article {Journal Articles} inproceedings {Conference Papers} proceedings {Proceedings} book {Books} incollection {Book Chapters} phdthesis {PhD Theses} unknown {Other Publications} other {{type}}}
he: {type, select, article {מאמרי עת} inproceedings {מאמרי כנסים} proceedings {כנסים} book {ספרים} incollection {פרקי ספרים} phdthesis {תזות דוקטורט} unknown {פרסומים אחרים} other {{type}}}

source: No Information Available
he: אין מידע זמין

# noInformationAvailableDescription
source: There is currently no information available about this researcher in our database. This could be because they have not yet published any papers that appear in DBLP, or their publications have not been linked to their profile.
he: אין כרגע מידע זמין על חוקר זה במאגר שלנו. ייתכן שהם עדיין לא פרסמו מאמרים שמופיעים ב-DBLP, או שהפרסומים שלהם לא קושרו לפרופיל שלהם.

# labMembersCategorySubtitle
source: Breakdown of lab members by category
he: פירוט חברי המעבדה לפי קטגוריה

# papersCollaborationSubtitle
source: Distribution of papers by number of lab member collaborators
he: חלוקת מאמרים לפי מספר שותפי פעולה מחברי המעבדה

# labMemberDistributionTitle
source: Lab Member Distribution
he: חלוקת חברי המעבדה

# labMembersPerPaperTitle
source: Lab Members Per Paper
he: חברי מעבדה למאמר

source: Most Student Collaborations
he: הכי הרבה שיתופי פעולה עם סטודנטים

source: Most Faculty Collaborations
he: הכי הרבה שיתופי פעולה עם סגל

# facultyLabel
source: Faculty:
he: סגל:

# collaborationsPerYearTitle
source: Collaborations Per Year
he: שיתופי פעולה לפי שנה

# graduationsPerYearTitle
source: Graduations Per Year
he: סיום תואר לפי שנה

# publicationsPerYearTitle
source: Publications Per Year
he: פרסומים לפי שנה

# recentGraduatesTitle
source: Recent Graduates
he: בוגרים לאחרונה

# publicationTypesDistributionTitle
source: Publication Types Distribution
he: חלוקת סוגי פרסומים

source: Recent Current Student Papers
he: מאמרים אחרונים של סטודנטים נוכחיים

source: Recent Graduated Student Papers
he: מאמרים אחרונים של סטודנטים בוגרים

source: Recent Postdoc Papers
he: מאמרים אחרונים של פוסט דוקטורנטים

source: Recent Current Faculty Papers
he: מאמרים אחרונים של סגל נוכחי

source: Recent Emeritus Faculty Papers
he: מאמרים אחרונים של סגל אמריטוס

source: Recent Lab Collaborations
he: שיתופי פעולה אחרונים במעבדה

source: Prolific Current Students
he: סטודנטים נוכחיים פרודוקטיביים

source: Prolific Graduated Students
he: סטודנטים בוגרים פרודוקטיביים

source: Prolific Postdocs
he: פוסט דוקטורנטים פרודוקטיביים

source: Prolific Current Faculty
he: סגל נוכחי פרודוקטיבי

source: Prolific Emeritus Faculty
he: סגל אמריטוס פרודוקטיבי

# studentsCategory
source: Students
he: סטודנטים

# unknownYear
source: Unknown
he: לא ידוע

# currentFacultyMostGraduates
source: Current Faculty with Most Graduates
he: סגל נוכחי עם הכי הרבה בוגרים

# emeritusFacultyMostGraduates
source: Emeritus Faculty with Most Graduates
he: סגל אמריטוס עם הכי הרבה בוגרים

# publicationsAxis
source: Publications
he: פרסומים

# collaborationsAxis
source: Collaborations
he: שיתופי פעולה

# graduationsAxis
source: Graduations
he: סיום תואר

# paper
source: {count, plural, =1{1 paper} other{{count} papers}}
he: {count, plural, =1{מאמר 1} other{{count} מאמרים}}

# graduate
source: {count, plural, =1{1 graduate} other{{count} graduates}}
he: {count, plural, =1{בוגר 1} other{{count} בוגרים}}

# currentStudentsCategory
source: Current Students
he: סטודנטים נוכחיים

# graduatedStudentsCategory
source: Graduated Students
he: סטודנטים בוגרים

# postdocsCategory
source: Postdocs
he: פוסט דוקטורנטים

# currentFacultyCategory
source: Current Faculty
he: סגל נוכחי

# emeritusFacultyCategory
source: Emeritus Faculty
he: סגל אמריטוס

# oneMemberCategory
source: One Member
he: חבר אחד

# twoMembersCategory
source: Two Members
he: שני חברים

# threeMembersCategory
source: Three Members
he: שלושה חברים

# fourMembersCategory
source: Four Members
he: ארבעה חברים

# fiveMembersCategory
source: Five Members
he: חמישה חברים

# sixPlusMembersCategory
source: Six+ Members
he: שישה חברים ויותר

source: Well-Connected Current Students
he: סטודנטים נוכחיים מחוברים היטב

source: Well-Connected Graduated Students
he: סטודנטים בוגרים מחוברים היטב

source: Well-Connected Postdocs
he: פוסט דוקטורנטים מחוברים היטב

source: Well-Connected Current Faculty
he: סגל נוכחי מחובר היטב

source: Well-Connected Emeritus Faculty
he: סגל אמריטוס מחובר היטב

# yearAxisLabel
source: Year
he: שנה

# collaborator
source: {count, plural, =1{1 collaborator} other{{count} collaborators}}
he: {count, plural, =1{שותף 1} other{{count} שותפים}}
